###################################################################

# Created by write_sdc on Wed Dec  4 14:49:42 2024

###################################################################
set sdc_version 1.7

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current mA
set_max_fanout 4 [current_design]
set_max_area 0
set_load -pin_load 0.005 [get_ports full]
set_load -pin_load 0.005 [get_ports empty]
set_load -pin_load 0.005 [get_ports {rd_data[15]}]
set_load -pin_load 0.005 [get_ports {rd_data[14]}]
set_load -pin_load 0.005 [get_ports {rd_data[13]}]
set_load -pin_load 0.005 [get_ports {rd_data[12]}]
set_load -pin_load 0.005 [get_ports {rd_data[11]}]
set_load -pin_load 0.005 [get_ports {rd_data[10]}]
set_load -pin_load 0.005 [get_ports {rd_data[9]}]
set_load -pin_load 0.005 [get_ports {rd_data[8]}]
set_load -pin_load 0.005 [get_ports {rd_data[7]}]
set_load -pin_load 0.005 [get_ports {rd_data[6]}]
set_load -pin_load 0.005 [get_ports {rd_data[5]}]
set_load -pin_load 0.005 [get_ports {rd_data[4]}]
set_load -pin_load 0.005 [get_ports {rd_data[3]}]
set_load -pin_load 0.005 [get_ports {rd_data[2]}]
set_load -pin_load 0.005 [get_ports {rd_data[1]}]
set_load -pin_load 0.005 [get_ports {rd_data[0]}]
set_max_capacitance 0.005 [get_ports clk_wr]
set_max_capacitance 0.005 [get_ports clk_rd]
set_max_capacitance 0.005 [get_ports wr_en]
set_max_capacitance 0.005 [get_ports rd_en]
set_max_capacitance 0.005 [get_ports rst]
set_max_capacitance 0.005 [get_ports {wr_data[15]}]
set_max_capacitance 0.005 [get_ports {wr_data[14]}]
set_max_capacitance 0.005 [get_ports {wr_data[13]}]
set_max_capacitance 0.005 [get_ports {wr_data[12]}]
set_max_capacitance 0.005 [get_ports {wr_data[11]}]
set_max_capacitance 0.005 [get_ports {wr_data[10]}]
set_max_capacitance 0.005 [get_ports {wr_data[9]}]
set_max_capacitance 0.005 [get_ports {wr_data[8]}]
set_max_capacitance 0.005 [get_ports {wr_data[7]}]
set_max_capacitance 0.005 [get_ports {wr_data[6]}]
set_max_capacitance 0.005 [get_ports {wr_data[5]}]
set_max_capacitance 0.005 [get_ports {wr_data[4]}]
set_max_capacitance 0.005 [get_ports {wr_data[3]}]
set_max_capacitance 0.005 [get_ports {wr_data[2]}]
set_max_capacitance 0.005 [get_ports {wr_data[1]}]
set_max_capacitance 0.005 [get_ports {wr_data[0]}]
set_max_fanout 4 [get_ports clk_wr]
set_max_fanout 4 [get_ports clk_rd]
set_max_fanout 4 [get_ports wr_en]
set_max_fanout 4 [get_ports rd_en]
set_max_fanout 4 [get_ports rst]
set_max_fanout 4 [get_ports {wr_data[15]}]
set_max_fanout 4 [get_ports {wr_data[14]}]
set_max_fanout 4 [get_ports {wr_data[13]}]
set_max_fanout 4 [get_ports {wr_data[12]}]
set_max_fanout 4 [get_ports {wr_data[11]}]
set_max_fanout 4 [get_ports {wr_data[10]}]
set_max_fanout 4 [get_ports {wr_data[9]}]
set_max_fanout 4 [get_ports {wr_data[8]}]
set_max_fanout 4 [get_ports {wr_data[7]}]
set_max_fanout 4 [get_ports {wr_data[6]}]
set_max_fanout 4 [get_ports {wr_data[5]}]
set_max_fanout 4 [get_ports {wr_data[4]}]
set_max_fanout 4 [get_ports {wr_data[3]}]
set_max_fanout 4 [get_ports {wr_data[2]}]
set_max_fanout 4 [get_ports {wr_data[1]}]
set_max_fanout 4 [get_ports {wr_data[0]}]
set_ideal_network [get_ports clk_wr]
set_ideal_network [get_ports clk_rd]
create_clock [get_ports clk_wr]  -period 100000  -waveform {0 50000}
set_clock_uncertainty 0  [get_clocks clk_wr]
set_clock_transition -max -rise 0.1 [get_clocks clk_wr]
set_clock_transition -max -fall 0.1 [get_clocks clk_wr]
set_clock_transition -min -rise 0.1 [get_clocks clk_wr]
set_clock_transition -min -fall 0.1 [get_clocks clk_wr]
create_clock [get_ports clk_rd]  -period 1000  -waveform {0 500}
set_clock_uncertainty 0  [get_clocks clk_rd]
set_clock_transition -max -rise 0.1 [get_clocks clk_rd]
set_clock_transition -max -fall 0.1 [get_clocks clk_rd]
set_clock_transition -min -rise 0.1 [get_clocks clk_rd]
set_clock_transition -min -fall 0.1 [get_clocks clk_rd]
set_input_delay -clock clk_rd  0.1  [get_ports clk_wr]
set_input_delay -clock clk_rd  0.1  [get_ports wr_en]
set_input_delay -clock clk_rd  0.1  [get_ports rd_en]
set_input_delay -clock clk_rd  0.1  [get_ports rst]
set_input_delay -clock clk_rd  0.1  [get_ports {wr_data[15]}]
set_input_delay -clock clk_rd  0.1  [get_ports {wr_data[14]}]
set_input_delay -clock clk_rd  0.1  [get_ports {wr_data[13]}]
set_input_delay -clock clk_rd  0.1  [get_ports {wr_data[12]}]
set_input_delay -clock clk_rd  0.1  [get_ports {wr_data[11]}]
set_input_delay -clock clk_rd  0.1  [get_ports {wr_data[10]}]
set_input_delay -clock clk_rd  0.1  [get_ports {wr_data[9]}]
set_input_delay -clock clk_rd  0.1  [get_ports {wr_data[8]}]
set_input_delay -clock clk_rd  0.1  [get_ports {wr_data[7]}]
set_input_delay -clock clk_rd  0.1  [get_ports {wr_data[6]}]
set_input_delay -clock clk_rd  0.1  [get_ports {wr_data[5]}]
set_input_delay -clock clk_rd  0.1  [get_ports {wr_data[4]}]
set_input_delay -clock clk_rd  0.1  [get_ports {wr_data[3]}]
set_input_delay -clock clk_rd  0.1  [get_ports {wr_data[2]}]
set_input_delay -clock clk_rd  0.1  [get_ports {wr_data[1]}]
set_input_delay -clock clk_rd  0.1  [get_ports {wr_data[0]}]
set_output_delay -clock clk_rd  0.1  [get_ports full]
set_output_delay -clock clk_rd  0.1  [get_ports empty]
set_output_delay -clock clk_rd  0.1  [get_ports {rd_data[15]}]
set_output_delay -clock clk_rd  0.1  [get_ports {rd_data[14]}]
set_output_delay -clock clk_rd  0.1  [get_ports {rd_data[13]}]
set_output_delay -clock clk_rd  0.1  [get_ports {rd_data[12]}]
set_output_delay -clock clk_rd  0.1  [get_ports {rd_data[11]}]
set_output_delay -clock clk_rd  0.1  [get_ports {rd_data[10]}]
set_output_delay -clock clk_rd  0.1  [get_ports {rd_data[9]}]
set_output_delay -clock clk_rd  0.1  [get_ports {rd_data[8]}]
set_output_delay -clock clk_rd  0.1  [get_ports {rd_data[7]}]
set_output_delay -clock clk_rd  0.1  [get_ports {rd_data[6]}]
set_output_delay -clock clk_rd  0.1  [get_ports {rd_data[5]}]
set_output_delay -clock clk_rd  0.1  [get_ports {rd_data[4]}]
set_output_delay -clock clk_rd  0.1  [get_ports {rd_data[3]}]
set_output_delay -clock clk_rd  0.1  [get_ports {rd_data[2]}]
set_output_delay -clock clk_rd  0.1  [get_ports {rd_data[1]}]
set_output_delay -clock clk_rd  0.1  [get_ports {rd_data[0]}]
