###################################################################

# Created by write_sdc on Sun Nov 17 22:58:19 2024

###################################################################
set sdc_version 1.7

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current mA
set_max_fanout 4 [current_design]
set_max_area 0
set_driving_cell -lib_cell INVX1TS [get_ports {x[15]}]
set_driving_cell -lib_cell INVX1TS [get_ports {x[14]}]
set_driving_cell -lib_cell INVX1TS [get_ports {x[13]}]
set_driving_cell -lib_cell INVX1TS [get_ports {x[12]}]
set_driving_cell -lib_cell INVX1TS [get_ports {x[11]}]
set_driving_cell -lib_cell INVX1TS [get_ports {x[10]}]
set_driving_cell -lib_cell INVX1TS [get_ports {x[9]}]
set_driving_cell -lib_cell INVX1TS [get_ports {x[8]}]
set_driving_cell -lib_cell INVX1TS [get_ports {x[7]}]
set_driving_cell -lib_cell INVX1TS [get_ports {x[6]}]
set_driving_cell -lib_cell INVX1TS [get_ports {x[5]}]
set_driving_cell -lib_cell INVX1TS [get_ports {x[4]}]
set_driving_cell -lib_cell INVX1TS [get_ports {x[3]}]
set_driving_cell -lib_cell INVX1TS [get_ports {x[2]}]
set_driving_cell -lib_cell INVX1TS [get_ports {x[1]}]
set_driving_cell -lib_cell INVX1TS [get_ports {x[0]}]
set_driving_cell -lib_cell INVX1TS [get_ports {coeff[15]}]
set_driving_cell -lib_cell INVX1TS [get_ports {coeff[14]}]
set_driving_cell -lib_cell INVX1TS [get_ports {coeff[13]}]
set_driving_cell -lib_cell INVX1TS [get_ports {coeff[12]}]
set_driving_cell -lib_cell INVX1TS [get_ports {coeff[11]}]
set_driving_cell -lib_cell INVX1TS [get_ports {coeff[10]}]
set_driving_cell -lib_cell INVX1TS [get_ports {coeff[9]}]
set_driving_cell -lib_cell INVX1TS [get_ports {coeff[8]}]
set_driving_cell -lib_cell INVX1TS [get_ports {coeff[7]}]
set_driving_cell -lib_cell INVX1TS [get_ports {coeff[6]}]
set_driving_cell -lib_cell INVX1TS [get_ports {coeff[5]}]
set_driving_cell -lib_cell INVX1TS [get_ports {coeff[4]}]
set_driving_cell -lib_cell INVX1TS [get_ports {coeff[3]}]
set_driving_cell -lib_cell INVX1TS [get_ports {coeff[2]}]
set_driving_cell -lib_cell INVX1TS [get_ports {coeff[1]}]
set_driving_cell -lib_cell INVX1TS [get_ports {coeff[0]}]
set_driving_cell -lib_cell INVX1TS [get_ports clk]
set_driving_cell -lib_cell INVX1TS [get_ports rst]
set_load -pin_load 0.005 [get_ports {y[31]}]
set_load -pin_load 0.005 [get_ports {y[30]}]
set_load -pin_load 0.005 [get_ports {y[29]}]
set_load -pin_load 0.005 [get_ports {y[28]}]
set_load -pin_load 0.005 [get_ports {y[27]}]
set_load -pin_load 0.005 [get_ports {y[26]}]
set_load -pin_load 0.005 [get_ports {y[25]}]
set_load -pin_load 0.005 [get_ports {y[24]}]
set_load -pin_load 0.005 [get_ports {y[23]}]
set_load -pin_load 0.005 [get_ports {y[22]}]
set_load -pin_load 0.005 [get_ports {y[21]}]
set_load -pin_load 0.005 [get_ports {y[20]}]
set_load -pin_load 0.005 [get_ports {y[19]}]
set_load -pin_load 0.005 [get_ports {y[18]}]
set_load -pin_load 0.005 [get_ports {y[17]}]
set_load -pin_load 0.005 [get_ports {y[16]}]
set_load -pin_load 0.005 [get_ports {y[15]}]
set_load -pin_load 0.005 [get_ports {y[14]}]
set_load -pin_load 0.005 [get_ports {y[13]}]
set_load -pin_load 0.005 [get_ports {y[12]}]
set_load -pin_load 0.005 [get_ports {y[11]}]
set_load -pin_load 0.005 [get_ports {y[10]}]
set_load -pin_load 0.005 [get_ports {y[9]}]
set_load -pin_load 0.005 [get_ports {y[8]}]
set_load -pin_load 0.005 [get_ports {y[7]}]
set_load -pin_load 0.005 [get_ports {y[6]}]
set_load -pin_load 0.005 [get_ports {y[5]}]
set_load -pin_load 0.005 [get_ports {y[4]}]
set_load -pin_load 0.005 [get_ports {y[3]}]
set_load -pin_load 0.005 [get_ports {y[2]}]
set_load -pin_load 0.005 [get_ports {y[1]}]
set_load -pin_load 0.005 [get_ports {y[0]}]
set_load -pin_load 0.005 [get_ports tick]
set_max_capacitance 0.005 [get_ports {x[15]}]
set_max_capacitance 0.005 [get_ports {x[14]}]
set_max_capacitance 0.005 [get_ports {x[13]}]
set_max_capacitance 0.005 [get_ports {x[12]}]
set_max_capacitance 0.005 [get_ports {x[11]}]
set_max_capacitance 0.005 [get_ports {x[10]}]
set_max_capacitance 0.005 [get_ports {x[9]}]
set_max_capacitance 0.005 [get_ports {x[8]}]
set_max_capacitance 0.005 [get_ports {x[7]}]
set_max_capacitance 0.005 [get_ports {x[6]}]
set_max_capacitance 0.005 [get_ports {x[5]}]
set_max_capacitance 0.005 [get_ports {x[4]}]
set_max_capacitance 0.005 [get_ports {x[3]}]
set_max_capacitance 0.005 [get_ports {x[2]}]
set_max_capacitance 0.005 [get_ports {x[1]}]
set_max_capacitance 0.005 [get_ports {x[0]}]
set_max_capacitance 0.005 [get_ports {coeff[15]}]
set_max_capacitance 0.005 [get_ports {coeff[14]}]
set_max_capacitance 0.005 [get_ports {coeff[13]}]
set_max_capacitance 0.005 [get_ports {coeff[12]}]
set_max_capacitance 0.005 [get_ports {coeff[11]}]
set_max_capacitance 0.005 [get_ports {coeff[10]}]
set_max_capacitance 0.005 [get_ports {coeff[9]}]
set_max_capacitance 0.005 [get_ports {coeff[8]}]
set_max_capacitance 0.005 [get_ports {coeff[7]}]
set_max_capacitance 0.005 [get_ports {coeff[6]}]
set_max_capacitance 0.005 [get_ports {coeff[5]}]
set_max_capacitance 0.005 [get_ports {coeff[4]}]
set_max_capacitance 0.005 [get_ports {coeff[3]}]
set_max_capacitance 0.005 [get_ports {coeff[2]}]
set_max_capacitance 0.005 [get_ports {coeff[1]}]
set_max_capacitance 0.005 [get_ports {coeff[0]}]
set_max_capacitance 0.005 [get_ports clk]
set_max_capacitance 0.005 [get_ports rst]
set_max_fanout 4 [get_ports {x[15]}]
set_max_fanout 4 [get_ports {x[14]}]
set_max_fanout 4 [get_ports {x[13]}]
set_max_fanout 4 [get_ports {x[12]}]
set_max_fanout 4 [get_ports {x[11]}]
set_max_fanout 4 [get_ports {x[10]}]
set_max_fanout 4 [get_ports {x[9]}]
set_max_fanout 4 [get_ports {x[8]}]
set_max_fanout 4 [get_ports {x[7]}]
set_max_fanout 4 [get_ports {x[6]}]
set_max_fanout 4 [get_ports {x[5]}]
set_max_fanout 4 [get_ports {x[4]}]
set_max_fanout 4 [get_ports {x[3]}]
set_max_fanout 4 [get_ports {x[2]}]
set_max_fanout 4 [get_ports {x[1]}]
set_max_fanout 4 [get_ports {x[0]}]
set_max_fanout 4 [get_ports {coeff[15]}]
set_max_fanout 4 [get_ports {coeff[14]}]
set_max_fanout 4 [get_ports {coeff[13]}]
set_max_fanout 4 [get_ports {coeff[12]}]
set_max_fanout 4 [get_ports {coeff[11]}]
set_max_fanout 4 [get_ports {coeff[10]}]
set_max_fanout 4 [get_ports {coeff[9]}]
set_max_fanout 4 [get_ports {coeff[8]}]
set_max_fanout 4 [get_ports {coeff[7]}]
set_max_fanout 4 [get_ports {coeff[6]}]
set_max_fanout 4 [get_ports {coeff[5]}]
set_max_fanout 4 [get_ports {coeff[4]}]
set_max_fanout 4 [get_ports {coeff[3]}]
set_max_fanout 4 [get_ports {coeff[2]}]
set_max_fanout 4 [get_ports {coeff[1]}]
set_max_fanout 4 [get_ports {coeff[0]}]
set_max_fanout 4 [get_ports clk]
set_max_fanout 4 [get_ports rst]
set_ideal_network [get_ports clk]
create_clock [get_ports clk]  -period 2  -waveform {0 1}
set_clock_uncertainty 0  [get_clocks clk]
set_clock_transition -max -rise 0.01 [get_clocks clk]
set_clock_transition -max -fall 0.01 [get_clocks clk]
set_clock_transition -min -rise 0.01 [get_clocks clk]
set_clock_transition -min -fall 0.01 [get_clocks clk]
set_input_delay -clock clk  0.05  [get_ports {x[15]}]
set_input_delay -clock clk  0.05  [get_ports {x[14]}]
set_input_delay -clock clk  0.05  [get_ports {x[13]}]
set_input_delay -clock clk  0.05  [get_ports {x[12]}]
set_input_delay -clock clk  0.05  [get_ports {x[11]}]
set_input_delay -clock clk  0.05  [get_ports {x[10]}]
set_input_delay -clock clk  0.05  [get_ports {x[9]}]
set_input_delay -clock clk  0.05  [get_ports {x[8]}]
set_input_delay -clock clk  0.05  [get_ports {x[7]}]
set_input_delay -clock clk  0.05  [get_ports {x[6]}]
set_input_delay -clock clk  0.05  [get_ports {x[5]}]
set_input_delay -clock clk  0.05  [get_ports {x[4]}]
set_input_delay -clock clk  0.05  [get_ports {x[3]}]
set_input_delay -clock clk  0.05  [get_ports {x[2]}]
set_input_delay -clock clk  0.05  [get_ports {x[1]}]
set_input_delay -clock clk  0.05  [get_ports {x[0]}]
set_input_delay -clock clk  0.05  [get_ports {coeff[15]}]
set_input_delay -clock clk  0.05  [get_ports {coeff[14]}]
set_input_delay -clock clk  0.05  [get_ports {coeff[13]}]
set_input_delay -clock clk  0.05  [get_ports {coeff[12]}]
set_input_delay -clock clk  0.05  [get_ports {coeff[11]}]
set_input_delay -clock clk  0.05  [get_ports {coeff[10]}]
set_input_delay -clock clk  0.05  [get_ports {coeff[9]}]
set_input_delay -clock clk  0.05  [get_ports {coeff[8]}]
set_input_delay -clock clk  0.05  [get_ports {coeff[7]}]
set_input_delay -clock clk  0.05  [get_ports {coeff[6]}]
set_input_delay -clock clk  0.05  [get_ports {coeff[5]}]
set_input_delay -clock clk  0.05  [get_ports {coeff[4]}]
set_input_delay -clock clk  0.05  [get_ports {coeff[3]}]
set_input_delay -clock clk  0.05  [get_ports {coeff[2]}]
set_input_delay -clock clk  0.05  [get_ports {coeff[1]}]
set_input_delay -clock clk  0.05  [get_ports {coeff[0]}]
set_input_delay -clock clk  0.05  [get_ports rst]
set_output_delay -clock clk  0.05  [get_ports {y[31]}]
set_output_delay -clock clk  0.05  [get_ports {y[30]}]
set_output_delay -clock clk  0.05  [get_ports {y[29]}]
set_output_delay -clock clk  0.05  [get_ports {y[28]}]
set_output_delay -clock clk  0.05  [get_ports {y[27]}]
set_output_delay -clock clk  0.05  [get_ports {y[26]}]
set_output_delay -clock clk  0.05  [get_ports {y[25]}]
set_output_delay -clock clk  0.05  [get_ports {y[24]}]
set_output_delay -clock clk  0.05  [get_ports {y[23]}]
set_output_delay -clock clk  0.05  [get_ports {y[22]}]
set_output_delay -clock clk  0.05  [get_ports {y[21]}]
set_output_delay -clock clk  0.05  [get_ports {y[20]}]
set_output_delay -clock clk  0.05  [get_ports {y[19]}]
set_output_delay -clock clk  0.05  [get_ports {y[18]}]
set_output_delay -clock clk  0.05  [get_ports {y[17]}]
set_output_delay -clock clk  0.05  [get_ports {y[16]}]
set_output_delay -clock clk  0.05  [get_ports {y[15]}]
set_output_delay -clock clk  0.05  [get_ports {y[14]}]
set_output_delay -clock clk  0.05  [get_ports {y[13]}]
set_output_delay -clock clk  0.05  [get_ports {y[12]}]
set_output_delay -clock clk  0.05  [get_ports {y[11]}]
set_output_delay -clock clk  0.05  [get_ports {y[10]}]
set_output_delay -clock clk  0.05  [get_ports {y[9]}]
set_output_delay -clock clk  0.05  [get_ports {y[8]}]
set_output_delay -clock clk  0.05  [get_ports {y[7]}]
set_output_delay -clock clk  0.05  [get_ports {y[6]}]
set_output_delay -clock clk  0.05  [get_ports {y[5]}]
set_output_delay -clock clk  0.05  [get_ports {y[4]}]
set_output_delay -clock clk  0.05  [get_ports {y[3]}]
set_output_delay -clock clk  0.05  [get_ports {y[2]}]
set_output_delay -clock clk  0.05  [get_ports {y[1]}]
set_output_delay -clock clk  0.05  [get_ports {y[0]}]
set_output_delay -clock clk  0.05  [get_ports tick]
